Repository: pwmt/zathura
Catalog: po/*.po
Languages: uk

source: `tabbed` support
uk: Підтримка `tabbed`

source: Define look with the set function
uk: Визначати вигляд за допомогою функції set

source: Implemented map function
uk: Реалізовано функцію map

source: `zathurarc` file
uk: Файл `zathurarc`

source: Prevent buffer overflow in realpath
uk: Запобігти переповненню буфера в realpath

source: Key evaluation when buffer is not empty
uk: Обробка клавіш, коли буфер не порожній

source: Use GFileMonitor instead of inotify
uk: Використовувати GFileMonitor замість inotify

source: Added document reload shortcut
uk: Додано скорочення для перезавантаження документа

source: Fixed toggle index
uk: Виправлено перемикання індексу

source: Fixed print command
uk: Виправлено команду друку

source: Fullscreen mode
uk: Повноекранний режим

source: Correct search result highlighting
uk: Коректне підсвічування результатів пошуку

source: Document password dialog
uk: Діалог пароля документа

source: Mouse support (Scroll, Mark and copy text to clipboard)
uk: Підтримка миші (прокрутка, позначення та копіювання тексту в буфер)

source: Keyboard navigation in the index view
uk: Клавіатурна навігація у поданні індексу

source: Different goto modes
uk: Різні режими goto

source: Auto adjustment when opening a document
uk: Автоматичне налаштування під час відкриття документа

source: Reload modified document automatically
uk: Автоматично перезавантажувати змінений документ

source: Recolor the page instead of inverting the colors
uk: Перефарбовувати сторінку замість інвертування кольорів

source: Working search function
uk: Працююча функція пошуку

source: Show and hide document information
uk: Показувати і ховати інформацію про документ

source: Follow internal links or open URI in a predefined browser
uk: Переходити за внутрішніми посиланнями або відкривати URI у визначеному браузері

source: Save the document
uk: Зберегти документ

source: Complete new, re-written interface
uk: Повністю новий, переписаний інтерфейс

source: Multiple printer support
uk: Підтримка кількох принтерів

source: Command history
uk: Історія команд

source: Show document index
uk: Показати індекс документа

source: Centered view
uk: Центроване подання

source: Add, save and open bookmarks
uk: Додати, зберегти і відкрити закладки

source: Marker support
uk: Підтримка маркерів

source: Highlight search results
uk: Виділяти результати пошуку

source: Buffered commands
uk: Буферизовані команди

source: `set` Function
uk: Функція `set`

source: Revert video function
uk: Повернути відеофункцію

source: Command completion
uk: Автодоповнення команд

source: Initial release
uk: Перший випуск

source: PDF;PS;PostScript;DjVU;document;presentation;viewer;
uk: PDF;PS;PostScript;DjVU;документ;презентація;переглядач;

source: '%s' must not be 0. Set to 1.
uk: '%s' не має дорівнювати 0. Встановити значення 1.

source: Invalid input '%s' given.
uk: Введено неправильні дані '%s'.

source: Invalid index '%s' given.
uk: Вказано невірний покажчик %s.

source: Copied selected text to selection %s: %s
uk: Скопійовано вибраний текст у вибірку %s: %s

source: Copied selected image to selection %s
uk: Скопійовано вибране зображення у вибірку %s

source: No document opened.
uk: Жодного документа не відкрито.

source: Invalid number of arguments given.
uk: Неправильна кількість наведених аргументів.

source: Could not update bookmark: %s
uk: Не вдалося оновити закладку: %s

source: Could not create bookmark: %s
uk: Не вдалося створити закладку: %s

source: Bookmark successfully updated: %s
uk: Закладка успішно оновлена: %s

source: Bookmark successfully created: %s
uk: Закладка успішно створена: %s

source: Removed bookmark: %s
uk: Закладку вилучено: %s

source: Failed to remove bookmark: %s
uk: Не вдалося вилучити закладку: %s

source: No bookmarks available.
uk: Закладки не доступні.

source: No such bookmark: %s
uk: Такої закладки немає: %s

source: Argument must be a nonzero number.
uk: Аргумент має бути ненульовим числом.

source: [%d]: page=<b>%2d</b>, x=%f, y=%f %s
uk: [%d]: сторінка=<b>%2d</b>, x=%f, y=%f %s

source: (current)
uk: (поточний)

source: No jumplist available.
uk: Список переходів недоступний.

source: Title
uk: Заголовок

source: Subject
uk: Тема

source: Keywords
uk: Ключові слова

source: Author
uk: Автор

source: Creator
uk: Творець

source: Producer
uk: Виробник

source: Creation date
uk: Дата створення

source: Modification date
uk: Дата зміни

source: Format
uk: Формат

source: Other
uk: Інше

source: No information available.
uk: Інформація відсутня.

source: Please check the man pages zathura(1) and zathurarc(5) for more information.
uk: Перегляньте man-сторінки zathura(1) і zathurarc(5) для докладнішої інформації.

source: Too many arguments.
uk: Занадто багато аргументів.

source: No arguments given.
uk: Жодного аргументу не наведено.

source: Printing is not permitted in strict sandbox mode
uk: Друк заборонено в режимі суворої пісочниці

source: Saving is not permitted in strict sandbox mode
uk: Збереження не дозволене в суворому режимі sandbox

source: Invalid number of arguments.
uk: Неправильна кількість аргументів.

source: Exporting attachments is not permitted in strict sandbox mode
uk: Експорт вкладень не дозволений у суворому режимі sandbox

source: Couldn't write attachment '%s' to '%s'.
uk: Неможливо записати вкладення '%s' у '%s'.

source: Wrote attachment '%s' to '%s'.
uk: Записано вкладення %s у %s.

source: Wrote image '%s' to '%s'.
uk: Зображення записано '% s' до '% s'.

source: Couldn't write image '%s' to '%s'.
uk: Не вдалося записати зображення "%s" у "%s".

source: Unknown image '%s'.
uk: Невідоме зображення '%s'.

source: Unknown attachment or image '%s'.
uk: Невідоме вкладення або зображення "%s".

source: Failed to execute command: %s
uk: Не вдалося виконати команду: %s

source: Exec is not permitted in strict sandbox mode
uk: Запуск у суворому режимі пісочниці заборонено

source: Argument must be a number.
uk: Аргумент повинен бути числом.

source: Page %d
uk: Сторінка %d

source: Attachments
uk: Вкладення

source: Images
uk: Зображення

source: Plugin does not support exporting attachments and images.
uk: Плагін не підтримує експорт вкладень і зображень.

source: Document contains no images or attachments
uk: Документ не містить зображень або вкладень

source: Font
uk: Шрифт

source: Default foreground color
uk: Типовий колір тексту

source: Default background color
uk: Типовий колір тла

source: Inputbar foreground color
uk: Колір тексту панелі введення

source: Inputbar background color
uk: Колір тла панелі введення

source: Statusbar foreground color
uk: Колір тексту панелі стану

source: Statsubar background color
uk: Колір тла панелі стану

source: Completion foreground color
uk: Колір тексту автодоповнення

source: Completion background color
uk: Колір тла автодоповнення

source: Completion group foreground color
uk: Колір тексту групи автодоповнення

source: Completion group background color
uk: Колір тла групи автодоповнення

source: Completion highlight foreground color
uk: Колір тексту виділення в автодоповненні

source: Completion highlight background color
uk: Колір тла виділення в автодоповненні

source: Error notification foreground color
uk: Колір тексту сповіщення про помилку

source: Error notification background color
uk: Колір тла сповіщення про помилку

source: Warning notification foreground color
uk: Колір тексту у сповіщеннях-попередженнях

source: Warning notifaction background color
uk: Колір тла у сповіщеннях-попередженнях

source: Notification foreground color
uk: Колір тексту сповіщень

source: Notification background color
uk: Колір тла сповіщень

source: Index mode foreground color
uk: Колір переднього плану в режимі покажчика

source: Index mode background color
uk: Колір тла у режимі покажчика

source: Index mode foreground color (active element)
uk: Колір переднього плану в режимі покажчика (активний елемент)

source: Index mode background color (active element)
uk: Колір тла у режимі покажчика (активний елемент)

source: Scrollbar foreground color
uk: Колір переднього плану смуги прокрутки

source: Scrollbar background color
uk: Колір фону смуги прокрутки

source: Initial window width
uk: Початкова ширина вікна

source: Initial window height
uk: Початкова висота вікна

source: Horizontal padding for the status, input, and notification bars
uk: Горизонтальні проміжки для панелей стану, вводу та сповіщення

source: Vertical padding for the status, input, and notification bars
uk: Вертикальні проміжки для панелей стану, вводу та сповіщення

source: Number of completion items
uk: Кількість елементів автодоповнення

source: Window icon
uk: Значок вікна

source: Command to execute in :exec
uk: Команда для виконання у :exec

source: Show or hide certain GUI elements
uk: Показати або приховати певні елементи графічного інтерфейсу

source: Database backend
uk: Бекенд бази даних

source: File monitor backend
uk: Бекенд файлового монітора

source: Zoom step
uk: Крок масштабування

source: Horizontal padding between pages
uk: Горизонтальні відступи між сторінками

source: Vertical padding between pages
uk: Вертикальні відступи між сторінками

source: Number of pages per row
uk: Кількість сторінок у рядку

source: Column of the first page
uk: Колонка першої сторінки

source: Render pages from right to left
uk: Відображати сторінки справа наліво

source: Scroll step
uk: Крок прокрутки

source: Horizontal scroll step
uk: Крок горизонтальної прокрутки

source: Full page scroll overlap
uk: Перекривання сторінки при прокрутці

source: Zoom minimum
uk: Мінімальний масштаб

source: Zoom maximum
uk: Максимальний масштаб

source: Maximum number of pages to keep in the cache
uk: Максимальна кількість сторінок, що зберігаються в кеші

source: Maximum size in pixels of thumbnails to keep in the cache
uk: Максимальний розмір у пікселях ескізів, що зберігаються в кеші

source: Number of positions to remember in the jumplist
uk: Довжина історії переходів

source: Recoloring (dark color)
uk: Перефарбування (темний колір)

source: Recoloring (light color)
uk: Перефарбування (світлий колір)

source: Color for highlighting
uk: Колір для виділення

source: Foreground color for highlighting
uk: Колір переднього плану для підсвічування

source: Color for highlighting (active)
uk: Колір для виділення (активний)

source: 'Loading ...' background color
uk: 'Завантаження ...' колір тла

source: 'Loading ...' foreground color
uk: 'Завантаження ...' колір переднього плану

source: Color used to highlight valid signatures
uk: Колір для підсвічування дійсних підписів

source: Color used to highlight signatures with warnings
uk: Колір для підсвічування підписів із попередженнями

source: Color used to highlight invalid signatures
uk: Колір для підсвічування недійсних підписів

source: Recolor pages
uk: Перефарбувати сторінки

source: When recoloring keep original hue and adjust lightness only
uk: Під час перефарбовування зберігати початковий відтінок і регулювати лише освітленість

source: When recoloring keep original image colors
uk: Під час перефарбовування зберігати початкові кольори зображення

source: When recoloring adjust lightness
uk: Під час перефарбування регулювати яскравість

source: Wrap scrolling
uk: Плавна прокрутка

source: Advance number of pages per row
uk: Збільшити кількість сторінок на рядок

source: Horizontally centered zoom
uk: Горизонтально вирівняний масштаб

source: Vertically center pages
uk: Вертикально вирівнювати сторінки

source: Align link target to the left
uk: Вирівнювати ціль посилання ліворуч

source: Let zoom be changed when following links
uk: Нехай масштабується при переході за посиланнями

source: Center result horizontally
uk: Вирівнювати результат по горизонталі

source: Render 'Loading ...'
uk: Візуалізація 'Завантаження ...'

source: Adjust to when opening file
uk: Підлаштовуватись при відкритті файлу

source: Show hidden files and directories
uk: Показати приховані файли та каталоги

source: Show directories
uk: Показати каталоги

source: Show recent files
uk: Показати нещодавні файли

source: Always open on first page
uk: Завжди відкривати на першій сторінці

source: Disable highlighting of search results
uk: Вимкнути підсвічування результатів пошуку

source: Double click to follow links
uk: Подвійний клік для переходу за посиланнями

source: Enable incremental search
uk: Увімкнути поступовий пошук

source: Clear search results on abort
uk: Очистити результати пошуку при скасуванні

source: Use basename of the file in the window title
uk: Використовувати базове ім'я файлу у заголовку вікна

source: Use ~ instead of $HOME in the filename in the window title
uk: Використовати ~ замість $HOME у назві файла у заголовку вікна

source: Display the page number in the window title
uk: Відображати номер сторінки у назві вікна

source: Use first page of a document as window icon
uk: Використовувати першу сторінку документа як піктограму вікна

source: Use basename of the file in the statusbar
uk: Використовувати базове ім'я файлу на панелі стану

source: Use ~ instead of $HOME in the filename in the statusbar
uk: Використовувати ~ замість $HOME у назві файлу на панелі стану

source: Display (current page / total pages) as a percent in the statusbar
uk: Показувати (поточна сторінка / загальна кількість сторінок) як відсоток у рядку стану

source: Enable synctex support
uk: Увімкнути підтримку Synctex

source: Synctex editor command
uk: Команда редактора Synctex

source: Synctex edit modifier
uk: Модифікатор редагування Synctex

source: Highlighter modifier
uk: Модифікатор підсвічування

source: Enable D-Bus service
uk: Увімкнути службу D-Bus

source: Raise window on certain D-Bus commands
uk: Підіймати вікно для певних команд D-Bus

source: Save history at each page change
uk: Зберігати історію при кожній зміні сторінки

source: The clipboard into which mouse-selected data will be written
uk: Буфер обміну, в який будуть записані дані, вибрані мишею

source: Enable notification after selecting text
uk: Увімкніть сповіщення після вибору тексту

source: Disable additional information for signatures embedded in the document.
uk: Вимкнути додаткову інформацію для підписів, вбудованих у документ.

source: Map a key sequence
uk: Створити комбінацію клавіш

source: Set an option
uk: Задати параметр

source: Unmap a key sequence
uk: Вилучити комбінацію клавіш

source: Dump settings to a file
uk: Зберегти налаштування у файл

source: Add a bookmark
uk: Додати закладку

source: Delete a bookmark
uk: Вилучити закладку

source: List all bookmarks
uk: Список усіх закладок

source: Jump to bookmark
uk: Перейти до закладки

source: Show recent jumps in jumplist
uk: Показати останні переходи в списку переходів

source: Close current file
uk: Закрити поточний файл

source: Show file information
uk: Показати інформацію про файл

source: Execute a command
uk: Виконати команду

source: Show help
uk: Покажіть довідку

source: Open document
uk: Відкрити документ

source: Close zathura
uk: Закрити zathura

source: Print document
uk: Надрукувати документ

source: Save document
uk: Зберегти документ

source: Save document (and force overwriting)
uk: Зберегти документ (і примусово перезаписати)

source: Save attachments
uk: Зберегти вкладення

source: Set page offset
uk: Встановити зміщення сторінки

source: Mark current location within the document
uk: Позначити поточне розташування в документі

source: Delete the specified marks
uk: Вилучити зазначені позначки

source: Remove highlights of current search results
uk: Прибрати підсвічування поточних результатів пошуку

source: Highlight current search results
uk: Виділити поточні результати пошуку

source: Show version information
uk: Показати інформацію про версію

source: Source config file
uk: Підвантажити файл конфігурації

source: Failed to run xdg-open.
uk: Не вдалося запустити xdg-open.

source: Opening external applications in strict sandbox mode is not permitted
uk: Відкривати зовнішні програми в режимі суворої пісочниці не дозволено

source: Link: page %d
uk: Посилання: сторінка %d

source: Link: %s
uk: Посилання: %s

source: Link: Invalid
uk: Посилання: Недійсне

source: Copied page number: %d
uk: Скопійований номер сторінки: %d

source: Copied link: %s
uk: Скопійоване посилання: %s

source: Reparents to window specified by xid (X11)
uk: Повертатися до вікна, вказаного за допомогою xid (X11)

source: Path to the config directory
uk: Шлях до каталогу конфігурації

source: Path to the data directory
uk: Шлях до каталогу з даними

source: Path to the cache directory
uk: Шлях до каталогу кеша

source: Path to the directories containing plugins
uk: Шлях до каталогів, які містять плаґіни

source: Fork into the background
uk: Запустити у фоні

source: Document password
uk: Пароль документа

source: Page number to go to
uk: Номер сторінки, на який потрібно перейти

source: Log level (debug, info, warning, error)
uk: Рівень журналювання (налагодження, інформація, попередження, помилка)

source: Print version information
uk: Інформація про версію для друку

source: Synctex editor (forwarded to the synctex command)
uk: Редактор Synctex (перенаправляється до команди Synctex)

source: Move to given synctex position
uk: Перейдіть до заданої позиції Synctex

source: Highlight given position in the given process
uk: Виділити задану позицію в даному процесі

source: Start in a non-default mode
uk: Запуск в режимі, що не використовується за замовчуванням

source: Bookmark to go to
uk: Закладка для переходу

source: Search for the given phrase and display results
uk: Шукати задану фразу і показувати результати

source: Signature is valid. This document is signed by %s on %s.
uk: Підпис дійсний. Цей документ підписано %s %s.

source: Signature certificate is expired.
uk: Сертифікат підпису прострочений.

source: Signature certificate is revoked.
uk: Сертифікат підпису відкликано.

source: Signature certificate is not trusted.
uk: Сертифікату підпису не довіряють.

source: Signature certificate is invalid.
uk: Сертифікат підпису недійсний.

source: Signature is invalid.
uk: Підпис недійсний.

source: Loading...
uk: Завантаження...

source: Copy image
uk: Скопіювати зображення

source: Save image as
uk: Зберегти зображення як

source: Printing page %d ...
uk: Друк сторінки %d...

source: Printing failed: %s
uk: Не вдалося надрукувати: %s

source: Invalid adjust mode: %d
uk: Недійсний режим коригування: %d

source: This document does not contain any index
uk: Цей документ не містить покажчика

source: Open file
uk: Відкрити файл

source: Pattern not found: %s
uk: Шаблон не знайдено: %s

source: [No name]
uk: [Без імені]

source: Could not read file from stdin and write it to a temporary file.
uk: Не вдалося прочитати файл із stdin та записати його у тимчасовий файл.

source: Could not read file from GIO and copy it to a temporary file.
uk: Не вдалося прочитати файл із GIO та скопіювати його у тимчасовий файл.

source: Enter password:
uk: Введіть пароль:

source: Unsupported file type. Please install the necessary plugin.
uk: Непідтримуваний тип файлу. Установіть необхідне розширення.

source: Document does not contain any pages
uk: Документ не містить жодної сторінки

source: File already exists: %s. Use :write! to overwrite it.
uk: Файл уже існує: %s. Використайте :write! для перезапису.

source: Failed to save document.
uk: Не вдалося зберегти документ.

source: Document saved.
uk: Документ збережено.

source: Invalid number of arguments passed: %zu instead of at least %u
uk: Неправильна кількість переданих аргументів: %zu замість принаймні %u

source: Unregistered mode specified: %s
uk: Вказано незареєстрований режим: %s

source: Invalid number of arguments passed
uk: Неправильна кількість переданих аргументів

source: Invalid modifier in %s
uk: Недійсний модифікатор у %s

source: Invalid special key value for %s
uk: Недійсне спеціальне значення клавіші для %s

source: Invalid special key value or mode %s
uk: Недійсне значення спеціальної клавіші або режиму %s

source: Not a valid shortcut function: %s
uk: Неправильна функція скорочення: %s

source: Not enough arguments.
uk: Аргументів недостатньо.

source: Unknown option: %s
uk: Невідомий параметр: %s

source: true
uk: правда

source: false
uk: неправда

source: No value defined for option: %s
uk: Не визначено значення для параметра: %s

source: Unknown value for option: %s
uk: Невідоме значення для параметра: %s

source: Not a valid command: %s
uk: Неправильна команда: %s

source: Invalid number of arguments passed: %zu instead of 1
uk: Неправильна кількість переданих аргументів: %zu замість 1

source: Failed to write JSON: %s
uk: Не вдалося записати JSON: %s
