Repository: pwmt/zathura
Catalog: po/*.po
Languages: uk

source: Minimalistic document viewer
uk: Простий переглядач документів

source: Zathura is a highly customizable and functional document viewer. It provides a minimalistic and space saving interface as well as an easy usage that mainly focuses on keyboard interaction. Zathura makes it possible to completely view and navigate through documents without using a mouse.
uk: Zathura - це дуже гнучкий та функціональний переглядач документів. Він забезпечує простий та компактний інтерфейс, а також просте використання, яке в основному фокусується на взаємодії з клавіатурою. Zathura дає можливість повністю переглядати та переміщатися по документах без використання миші.

source: Zathura can be extended to support multiple document formats using plugins. Other features include:
uk: Zathura може бути розширений для підтримки декількох форматів документів за допомогою плаґінів. Інші можливості включають:

source: SyncTeX forward and backward synchronization support.
uk: Підтримка Synctex синхронізації вперед та назад .

source: Quickmarks and bookmarks.
uk: Швидкі закладки та закладки.

source: Automatic document reloading.
uk: Автоматичне перезавантаження документів.

source: Reading a PDF file
uk: Читання PDF-файлу

source: Opening a file with the `open` command
uk: Відкриття файлу командою `open`

source: Following links
uk: Перехід за посиланнями

source: Listing and selecting bookmakrs
uk: Список і вибір закладок

source: Implement single page layout and equal height/width modes (#706, #724, #447, #289)
uk: Реалізувати односторінковий макет і режими однакової висоти/ширини (#706, #724, #447, #289)

source: Use single page layout for presentation mode (#686, #666)
uk: Використовувати односторінковий макет для режиму презентації (#686, #666)

source: Fix blurry rendering and repeated loading messages (#864, #860)
uk: Виправити розмите відображення та повторні повідомлення завантаження (#864, #860)

source: Allow to disable copying to clipboard (#835)
uk: Дозволити вимкнення копіювання до буфера обміну (#835)

source: Fix smooth scrolling using Ctrl and arrow keys (#872)
uk: Виправити плавну прокрутку за допомогою Ctrl і стрілок (#872)

source: Fork to background if opening with multiple files only if --fork is specified (#855)
uk: Переходити у фон при відкритті кількох файлів лише якщо вказано --fork (#855)

source: Fix handling of PageUp and PageDown (#861)
uk: Виправити обробку PageUp і PageDown (#861)

source: Fix handling of mappings with special keys (#862)
uk: Виправити обробку прив'язок зі спеціальними клавішами (#862)

source: Integrate Gtk+-specific parts of girara
uk: Інтегрувати Gtk+-специфічні частини girara

source: Switch to date-based version numbers
uk: Перейти на версії на основі дат

source: Fix warnings from CSS generation (#824)
uk: Виправити попередження під час генерації CSS (#824)

source: Apply correct scaling when recoloring (#836)
uk: Застосовувати правильне масштабування під час перефарбування (#836)

source: Make sure jumplist stays valid after close (#835)
uk: Переконатися, що список переходів лишається дійсним після закриття (#835)

source: Disable message in incremental search (#227, #847)
uk: Вимкнути повідомлення в інкрементальному пошуку (#227, #847)

source: Fix seccomp rules with musl (#843)
uk: Виправити правила seccomp з musl (#843)

source: Implement custom drawing for document widget (#580, #657, #736, #785, #795, #797, #826)
uk: Реалізувати власне малювання для віджета документа (#580, #657, #736, #785, #795, #797, #826)

source: Switch default database to sqlite and drop plain database
uk: Перемкнути типову базу даних на sqlite і прибрати просту базу даних

source: Notify users if no attachments and images are available to export
uk: Повідомляти користувачів, якщо немає вкладень і зображень для експорту

source: Make index-* configurable after init (#799)
uk: Зробити index-* налаштовуваним після init (#799)

source: Support numeric keypad mappings
uk: Підтримка прив'язок цифрової клавіатури

source: Provide correct number of pages (#814)
uk: Надавати правильну кількість сторінок (#814)

source: Undo size-allocate callback changes
uk: Скасувати зміни callback size-allocate

source: Fix temporary file names for better content-type detection
uk: Виправити назви тимчасових файлів для кращого визначення типу вмісту

source: Validate appstream files with appstreamcli
uk: Перевіряти файли appstream через appstreamcli

source: Split page-padding into page-h-padding and page-v-padding
uk: Розділити відступи сторінки на page-h-padding і page-v-padding

source: Fix memory leak and callback type error (#767)
uk: Виправити витік пам'яті та помилку типу callback (#767)

source: Warn if plugins do not support exporting images or attachments (#334)
uk: Попереджати, якщо плагіни не підтримують експорт зображень або вкладень (#334)

source: Add shortcut to open files via file chooser dialog
uk: Додати скорочення для відкриття файлів через діалог вибору файлу

source: Refactor rendering of pages
uk: Рефакторинг рендерингу сторінок

source: Add lightness adjustment for recoloring
uk: Додати регулювання яскравості для перефарбування

source: Initial support for OpenBSD sandbox
uk: Початкова підтримка sandbox OpenBSD

source: Fix closing of documents
uk: Виправити закриття документів

source: Fix crash when opening documents
uk: Виправити падіння під час відкриття документів

source: Fix build on macOS
uk: Виправити збирання на macOS

source: Hide page label if the same as page number
uk: Ховати мітку сторінки, якщо вона збігається з номером сторінки

source: Cache SyncTeX parser for faster operation
uk: Кешувати парсер SyncTeX для швидшої роботи

source: Revert changes for documents with multiple page sizes
uk: Скасувати зміни для документів із кількома розмірами сторінок

source: Various fixes and improvements
uk: Різні виправлення та покращення

source: Bump plugin ABI
uk: Підвищити ABI плагіна

source: Split sandbox functionality into separate zathura-sandbox binary
uk: Винести функціональність sandbox в окремий бінарний файл zathura-sandbox

source: Split off new command bjump from blist
uk: Виділити нову команду bjump з blist

source: Add initial landlock support to sandbox
uk: Додати початкову підтримку landlock до sandbox

source: Fix repeated search
uk: Виправити повторний пошук

source: Implement jumplist command
uk: Реалізувати команду jumplist

source: Fix issues with document with multiple page sizes
uk: Виправити проблеми з документом, що має кілька розмірів сторінок

source: Move to Github
uk: Перейти на GitHub

source: Reduce minimum glib version
uk: Зменшити мінімальну версію glib

source: Remove normal sandbox mode
uk: Вилучити звичайний режим sandbox

source: Compatibility with girara 0.4.3
uk: Сумісність з girara 0.4.3

source: Remove highlight-transparency setting. Set the alpha component of highlight-color, highlight-active-color and highlight-fg instead.
uk: Вилучити параметр highlight-transparency. Натомість задайте альфа-складову для highlight-color, highlight-active-color і highlight-fg.

source: Remove smooth-reload setting. Smooth reloading is now always enabled.
uk: Вилучити параметр smooth-reload. Плавне перезавантаження тепер завжди увімкнено.

source: Remove plain database backend. The sqlite database backend imports the data from the plain database the first time. sqlite is now a hard dependency.
uk: Вилучити простий бекенд бази даних. Бекенд sqlite під час першого запуску імпортує дані з простої бази даних. sqlite тепер є обов'язковою залежністю.

source: Fix a segfault if dbus is not enabled.
uk: Виправити segfault, якщо dbus не увімкнено.

source: Add support to display signatures
uk: Додати підтримку відображення підписів

source: Fix clearing of highlighted links
uk: Виправити очищення підсвічених посилань

source: Make some key modifiers configurable
uk: Зробити деякі модифікатори клавіш налаштовуваними

source: Fix text selection on rotated pages
uk: Виправити виділення тексту на повернутих сторінках

source: Fix gap between pages
uk: Виправити проміжок між сторінками

source: Update translations
uk: Оновити переклади

source: Improve text selection
uk: Покращити виділення тексту

source: `seccomp`: Make glibc fallback to clone instead of using clone3
uk: `seccomp`: змусити glibc використовувати fallback на clone замість clone3

source: `magic` is now a required dependency
uk: `magic` тепер обов'язкова залежність

source: Add '$f' and '$p' expansions to 'exec' shortcut function
uk: Додати розширення '$f' і '$p' до функції скорочення 'exec'

source: Fix build with meson 0.60
uk: Виправити збирання з meson 0.60

source: Add :source command
uk: Додати команду :source

source: Account for page padding in full scroll
uk: Враховувати відступи сторінки під час повної прокрутки

source: Add foreground color for links
uk: Додати колір переднього плану для посилань

source: Add :save and :save! aliases for :write and :write!
uk: Додати псевдоніми :save і :save! для :write і :write!

source: Fix invalid zoom when opening document with 'adjust-open width' option
uk: Виправити некоректний масштаб під час відкриття документа з опцією 'adjust-open width'

source: Add --find option to the CLI
uk: Додати опцію --find до CLI

source: Support recolor with transparency
uk: Підтримка перефарбування з прозорістю

source: Fix step size for mouse wheel scrolling
uk: Виправити розмір кроку прокрутки коліщатком миші

source: Lookup fileinfo from database by hash as fallback
uk: Шукати fileinfo в базі даних за хешем як резервний варіант

source: Fix expansion of ~ and ~user when opening files
uk: Виправити розгортання ~ і ~user під час відкриття файлів

source: Add fish completion
uk: Додати автодоповнення для fish

source: Drop support for old libsynctex
uk: Прибрати підтримку старої libsynctex

source: Add bash and zsh completions
uk: Додати автодоповнення для bash і zsh

source: Add RTL layout of pages
uk: Додати RTL-макет сторінок

source: Port to newer libsynctex
uk: Портувати на новішу libsynctex

source: Improved HiDPI support
uk: Покращена підтримка HiDPI

source: Display page labels
uk: Показувати мітки сторінок

source: Add experimental seccomp filters
uk: Додати експериментальні фільтри seccomp

source: Replace build system with meson
uk: Замінити систему збирання на meson

source: Fix memory leaks
uk: Виправити витоки пам'яті

source: Rework plugin initialization
uk: Переробити ініціалізацію плагінів

source: Improved logging
uk: Покращене журналювання

source: Improve page mode toggling
uk: Покращити перемикання режимів сторінок

source: Parallel build of manpages
uk: Паралельне збирання man-сторінок

source: Build even without SyncTex
uk: Збирати навіть без SyncTex

source: Children should not fork
uk: Дочірні процеси не мають виконувати fork

source: Recent files support
uk: Підтримка нещодавніх файлів

source: Substitute home with tilde
uk: Замінювати home тильдою

source: Open URLs
uk: Відкривати URL

source: Store tmp files in only one location
uk: Зберігати tmp-файли лише в одному місці

source: Print target selection
uk: Друкувати вибір цілі

source: Allow .dylib plugins on Mac OS X
uk: Дозволити .dylib-плагіни на Mac OS X

source: Fix dual page render breakage of adjust_window
uk: Виправити поломку рендерингу двох сторінок у adjust_window

source: Resolve memory leak while reloading file
uk: Усунути витік пам'яті під час перезавантаження файлу

source: Prevent segmentation fault when smooth zooming with mouse
uk: Запобігти segmentation fault під час плавного масштабування мишею

source: Cache thumbnails to support smooth zooming
uk: Кешувати ескізи для підтримки плавного масштабування

source: Check scale value correctness
uk: Перевіряти правильність значення масштабу

source: Fix segmentation fault caused by bidirectional scrolling
uk: Виправити segmentation fault, спричинений двонапрямною прокруткою

source: Add SyntaxView
uk: Додати SyntaxView

source: Print debug information to D-Bus
uk: Виводити налагоджувальну інформацію в D-Bus

source: Fix scroll down/up in dual-page mode
uk: Виправити прокрутку вниз/вгору в режимі двох сторінок

source: Option to hide notification after selection
uk: Опція ховати сповіщення після вибору

source: Introduce cache directory
uk: Запровадити каталог кешу

source: Introduce smooth-scroll and smooth-zoom
uk: Запровадити smooth-scroll і smooth-zoom

source: Add vim style exec
uk: Додати exec у стилі vim

source: Option to ignore images while recoloring
uk: Опція ігнорувати зображення під час перефарбування

source: Take advantage of shared or system SyncTex parser library
uk: Використовувати спільну або системну бібліотеку парсера SyncTex

source: Update dependency version of girara
uk: Оновити версію залежності girara

source: Better SyncTex support
uk: Краща підтримка SyncTex

source: Change cursor if mouse is over link
uk: Змінювати курсор, якщо миша над посиланням

source: Colored build output
uk: Кольоровий вивід збирання

source: Sphinx documentation
uk: Документація Sphinx

source: Full SyncTex support
uk: Повна підтримка SyncTex

source: D-Bus interface
uk: Інтерфейс D-Bus

source: Simple vim plugin for SyncTex support
uk: Простий vim-плагін для підтримки SyncTex

source: Add shortcuts for ^C and Esc in all modes
uk: Додати скорочення для ^C і Esc у всіх режимах

source: Use the actual mode in mode toggle calls
uk: Використовувати фактичний режим у викликах перемикання режиму

source: Only copy selected text in normal and fullscreen mode
uk: Копіювати лише виділений текст у звичайному та повноекранному режимі

source: Translate error messages
uk: Перекласти повідомлення про помилки

source: Correctly safe print setting state
uk: Коректно зберігати стан налаштувань друку

source: Add --mode option
uk: Додати параметр --mode

source: Expose more properties via D-Bus
uk: Експортувати більше властивостей через D-Bus

source: Center pages
uk: Центрувати сторінки

source: Replace glib memory functions with try version
uk: Замінити функції пам'яті glib на try-версії

source: Align highlighted rectangles correctly
uk: Коректно вирівнювати підсвічені прямокутники

source: Implement G and gg for index mode
uk: Реалізувати G і gg для режиму індексу

source: Implement TOGGLE for sc_navigate_index
uk: Реалізувати TOGGLE для sc_navigate_index

source: Preserve horizontal position when scrolling to PAGE_TOP/BOTTOM
uk: Зберігати горизонтальну позицію під час прокрутки до PAGE_TOP/BOTTOM

source: Implement shortcuts for scrolling to page top/bottom
uk: Реалізувати скорочення для прокрутки до верху/низу сторінки

source: Set position on document load only if no page was specified
uk: Встановлювати позицію під час завантаження документа, лише якщо сторінку не задано

source: Bail out early if we get TOP or BOTTOM
uk: Завчасно виходити, якщо отримано TOP або BOTTOM

source: Replace fullscreen mode with presentation mode
uk: Замінити повноекранний режим на режим презентації

source: Remove GTK+2 support
uk: Вилучити підтримку GTK+2

source: Update documentation
uk: Оновити документацію

source: Resolve layout problems
uk: Усунути проблеми макета

source: Use GTK+3 by default
uk: Використовувати GTK+3 типово

source: Rewritten render logic
uk: Переписана логіка рендерингу

source: Fixed page refresh in certain situations
uk: Виправлено оновлення сторінки в певних ситуаціях

source: Make the X clipboard buffer
uk: Використовувати буфер обміну X

source: Allow number in quickmarks
uk: Дозволити числа в quickmarks

source: Workaround for print quality issues
uk: Обхідне рішення для проблем якості друку

source: Resolve memory leak
uk: Усунути витік пам'яті

source: Report missing plugin or unsupported file types
uk: Повідомляти про відсутній плагін або непідтримувані типи файлів

source: More vim-like search behaviour
uk: Поведінка пошуку, ближча до vim

source: Introduced show-{h,v}-scrollbar settings
uk: Додано налаштування show-{h,v}-scrollbar

source: Enhancement of the jumplist mechanism
uk: Покращення механізму списку переходів

source: Use jumplists with marks
uk: Використовувати списки переходів із позначками

source: More vim-like jump behaviour
uk: Поведінка переходів, ближча до vim

source: Improved bisect
uk: Покращений bisect

source: Update page number on mouse scroll
uk: Оновлювати номер сторінки під час прокрутки мишею

source: Introduced window-title-page option
uk: Додано опцію window-title-page

source: LRU caching algorithm
uk: Алгоритм кешування LRU

source: Bisect functionality
uk: Функціональність bisect

source: Allow negative offsets
uk: Дозволити від'ємні зсуви

source: Option --page to open at the specified page
uk: Опція --page для відкриття на вказаній сторінці

source: Scale vertical/horizontal scrolling in respect to the buffer
uk: Масштабувати вертикальну/горизонтальну прокрутку відносно буфера

source: Add statusbar-basename option
uk: Додати опцію statusbar-basename

source: Implement colors for 'Loading...'-text
uk: Реалізувати кольори для тексту 'Loading...'

source: Don't render same page multiple times
uk: Не рендерити ту саму сторінку кілька разів

source: Use libmagic if available
uk: Використовувати libmagic, якщо доступна

source: Some other bug fixes and updated translations
uk: Інші виправлення помилок і оновлені переклади

source: Implemented jumplist (^o, ^i)
uk: Реалізовано список переходів (^o, ^i)

source: Update current page when following links
uk: Оновлювати поточну сторінку при переході за посиланнями

source: Scroll horizontally with shift and mouse wheel
uk: Прокручувати горизонтально за допомогою Shift і коліщатка миші

source: Page aware scrolling
uk: Прокрутка по сторінкам

source: SyncTeX forward synchronisation
uk: Пряма синхронізація SyncTeX

source: Update shortcuts
uk: Оновити скорочення

source: SyncTeX backwards synchronisation
uk: Зворотна синхронізація SyncTeX

source: Fix request-page-setup
uk: Виправити request-page-setup

source: Fix window adustment
uk: Виправити налаштування вікна

source: Better GTK3 integration
uk: Краща інтеграція GTK3

source: Added first-page-colum setting
uk: Додано параметр first-page-colum

source: Added recolor-keephue setting
uk: Додано параметр recolor-keephue

source: New languages
uk: Нові мови

source: Better print support
uk: Краща підтримка друку

source: Improve document links
uk: Покращити посилання документа

source: Render last-viewed pages with a higher priority
uk: Рендерити останні переглянуті сторінки з вищим пріоритетом

source: Export images and attachments
uk: Експортувати зображення та вкладення

source: Open multiple documents
uk: Відкрити кілька документів

source: Plugin manager
uk: Менеджер плагінів

source: Add 'open-first-page' setting
uk: Додати параметр 'open-first-page'

source: Free invisible pages after specific time
uk: Вивільняти невидимі сторінки через певний час

source: Set log level via command line
uk: Встановити рівень журналювання через командний рядок

source: Update GTK3 support
uk: Оновити підтримку GTK3

source: Completion for :write command
uk: Автодоповнення для команди :write

source: Simplified plugin loading
uk: Спрощене завантаження плагінів

source: Allow counter-clockwise rotation
uk: Дозволити обертання проти годинникової стрілки

source: Changeable page-padding
uk: Змінний відступ сторінки

source: Introduced girara version check
uk: Додано перевірку версії girara

source: Detect sqlite automatically
uk: Автоматично визначати sqlite

source: Update window title
uk: Оновити заголовок вікна

source: Macro to register plugins
uk: Макрос для реєстрації плагінів

source: Fix issues with the display of the current page number
uk: Виправити проблеми з відображенням поточного номера сторінки

source: Ability to scroll to the full left or full right border
uk: Можливість прокручувати до крайньої лівої або правої межі

source: Reimplement the render thread with GThreadPool
uk: Пере реалізувати потік рендерингу з GThreadPool

source: Use the correct color to highlight results
uk: Використовувати правильний колір для підсвічування результатів

source: Support to use both database backends
uk: Підтримка використання обох бекендів бази даних

source: Additional notifications on errors
uk: Додаткові сповіщення про помилки

source: Option to hide hidden directories
uk: Опція ховати приховані каталоги

source: Do not overwrite existing files with :write
uk: Не перезаписувати наявні файли через :write

source: Fix flicker in text selection
uk: Виправити мерехтіння під час виділення тексту

source: Fixed several memory leaks
uk: Виправлено кілька витоків пам'яті

source: Complete rewrite of zathura
uk: Повне переписування zathura

source: Uses the girara interface library
uk: Використовує бібліотеку інтерфейсу girara

source: Plugin system for different document types
uk: Система плагінів для різних типів документів

source: Better configuration
uk: Краща конфігурація

source: Quickmarks
uk: Швидкі позначки

source: Ignoring MOD5 which is used on some keyboards
uk: Ігнорування MOD5, що використовується на деяких клавіатурах

source: Fix scroll_wrap (#52)
uk: Виправити scroll_wrap (#52)

source: Don't invert y coordinates (#42)
uk: Не інвертувати координати y (#42)

source: Certain memory leaks and other small issues
uk: Певні витоки пам'яті та інші дрібні проблеми

source: Fixed bookmark handling
uk: Виправлено обробку закладок

source: Support :digits
uk: Підтримка :digits

source: Save zoom level per file
uk: Зберігати рівень масштабу для кожного файлу

source: Fix backwards searching
uk: Виправити зворотний пошук

source: Fix blinking while switching pages
uk: Виправити мерехтіння під час перемикання сторінок

source: Fix input issues in fullscreen mode
uk: Виправити проблеми введення в повноекранному режимі

source: Update text searching
uk: Оновити пошук тексту

source: Support for poppler >= 0.15
uk: Підтримка poppler >= 0.15

source: Fixed print command with multiple arguments
uk: Виправлено команду друку з кількома аргументами

source: Fixed GOptionEntries
uk: Виправлено GOptionEntries

source: Fixed segmentation faults
uk: Виправлено segmentation fault

source: Wrap around scrolling
uk: Циклічна прокрутка

source: Display scroll percentage in statusbar
uk: Показувати відсоток прокрутки в рядку стану

source: More familiar zoom key bindings
uk: Звичніші клавіші масштабу

source: Support reading files from stdin
uk: Підтримка читання файлів зі stdin

source: Open command with appended current file path
uk: Команда open з доданим поточним шляхом до файлу

source: Following XDG specification
uk: Дотримання специфікації XDG

source: Colored window and view port
uk: Кольорове вікно та область перегляду

source: File reloading fix
uk: Виправлення перезавантаження файлу

source: Update manpage
uk: Оновити man-сторінку

source: Fixed critical usability bug
uk: Виправлено критичну помилку зручності використання

source: Improved and fixed completion
uk: Покращене та виправлене автодоповнення

source: Optional parameters for the print command
uk: Необов'язкові параметри для команди друку

source: Escape filenames
uk: Екранувати імена файлів

source: Resolved some memory leaks
uk: Усунуто деякі витоки пам'яті

source: Global configuration file
uk: Глобальний файл конфігурації

source: Specify configuration directory
uk: Вказати каталог конфігурації

source: Configureable modes
uk: Налаштовувані режими

source: Smooth scrolling
uk: Плавна прокрутка

source: Extended statusbar string manipulation
uk: Розширена обробка рядка стану

source: Strip executable
uk: Очищати виконуваний файл

source: Change window title to filename
uk: Змінювати заголовок вікна на ім'я файлу

source: Fixation of the URI command
uk: Виправлення команди URI

source: Update the behaviour of sc_scroll
uk: Оновити поведінку sc_scroll

source: Half/Full-page scrolling
uk: Прокрутка на пів/повну сторінку

source: Check document health in sc_reload
uk: Перевіряти стан документа в sc_reload
